Templates/houle/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    RIGHT
    {
        type            zeroGradient;
    }

    BOTTOM
    {
        type            zeroGradient;
    }

    frontPlane
    {
        type            empty;
    }

    backPlane
    {
        type            empty;
    }

    TOP
    {
        type            totalPressure;
        p0              uniform 0;
    }

}


// ************************************************************************* //
