Templates/houle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
( 
   
    (  0.0 -0.1  0.0) //0
    ( 26.0 -0.1  0.0) //1
    ( 26.0 0.0  0.0) //2
    (  0.0 0.0  0.0) //3

    (  0.0 -0.1 2) //4
    ( 26.0 -0.1 2) //5
    ( 26.0 0.0 2) //6
    (  0.0 0.0 2) //7

    (  0.0 -0.1 2) //8
    ( 26.0 -0.1 2) //9
    ( 26.0 0.0 2) //10
    (  0.0 0.0 2) //11

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (910 1 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    INLET
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    RIGHT
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }
    BOTTOM
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    TOP
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    frontPlane
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    backPlane
    {
        type empty;
        faces
        (
            (3 2 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
