Templates/houle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime; //!!!!!!!!

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          0.001;

writeControl    adjustable;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.15;

maxDeltaT       1.0;

libs
(
    "libbuoyancyModifiedTurbulenceModels.so"
);


// ************************************************************************* //

functions
{
    line
    {
        type            sets;
        libs            ("libsampling.so");
        enabled         true;
        writeControl    timeStep;
        writeInterval    1;
        fixedLocations false;
        interpolationScheme cellPoint;
        setFormat       raw;
        sets
        (
            S3-9.517
            {
                type uniform;
                axis distance;
                start   ( 9.517 -0.05 0 );
                end     ( 9.517 -0.05 2.155 );
                nPoints 201;
            }
            S4-9.927
            {
                type uniform;
                axis distance;
                start   ( 9.927 -0.05 0 );
                end     ( 9.927 -0.05 2.155 );
                nPoints 201;
            }
	    S5-10.927
            {
                type uniform;
                axis distance;
         	start   ( 10.927 -0.05 0 );
          	end     ( 10.927 -0.05 2.155 );
                nPoints 201;
            }
	    S6-11.657
            {
                type uniform;
                axis distance;
         	start   ( 11.657 -0.05 0 );
          	end     ( 11.657 -0.05 2.155 );
                nPoints 201;
            }
            inlet-0.0
            {
                type uniform;
                axis distance;
                start   (  0.0 -0.05 0 );
                end     (  0.0 -0.05 2.155 );
                nPoints 201;
            }
        );
        fields (
            alpha.water 
        );
    }
}

